package chat

import "github.com/laconiz/eros/oceanus/example/proto"

// ---------------------------------------------------------------------------------------------------------------------

type UserID = proto.UserID
type RoomID = proto.RoomID
type User = proto.User

// ---------------------------------------------------------------------------------------------------------------------
// 进入房间消息

type EnterREQ struct {
	ID RoomID `json:"id"`
}

// ---------------------------------------------------------------------------------------------------------------------
// 房间信息消息

type RoomACK struct {
	ID    RoomID   `json:"id"`    // 房间ID
	Users []UserID `json:"users"` // 用户列表
}

// ---------------------------------------------------------------------------------------------------------------------
// 聊天消息

type SpeakREQ struct {
	content string `json:"content"` // 聊天内容
}

type SpeakACK struct {
	User    UserID `json:"user"`    // 用户ID
	Content string `json:"content"` // 聊天内容
}

// ---------------------------------------------------------------------------------------------------------------------
// 退出房间消息

type QuitREQ struct {
	ID RoomID `json:"id"` // 房间ID
}

// ---------------------------------------------------------------------------------------------------------------------

func init() {

}
